{
    "Teresa Ibarra": "Please note that these warnings are just used to help the Homebrew maintainers\nwith debugging if you file an issue. If everything you use Homebrew for is\nworking fine: please don't worry and just ignore them. Thanks!\nWarning: Some directories in /usr/local/share/man aren't writable.\nThis can happen if you \"sudo make install\" software that isn't managed\nby Homebrew. If a brew tries to add locale information to one of these\ndirectories, then the install will fail during the link step.\nYou should probably `chown` them:\n/usr/local/share/man/mann\nWarning: Your XQuartz (2.7.6) is outdated\nPlease install XQuartz 2.7.7:\nhttps://xquartz.macosforge.org\nWarning: Unbrewed dylibs were found in /usr/local/lib.\nIf you didn't put them there on purpose they could cause problems when\nbuilding Homebrew formulae, and may need to be deleted.\nUnexpected dylibs:\n/usr/local/lib/libtcl8.6.dylib\n/usr/local/lib/libtk8.6.dylib\nWarning: Unbrewed header files were found in /usr/local/include.\nIf you didn't put them there on purpose they could cause problems when\nbuilding Homebrew formulae, and may need to be deleted.\nUnexpected header files:\n/usr/local/include/fakemysql.h\n/usr/local/include/fakepq.h\n/usr/local/include/fakesql.h\n/usr/local/include/itcl.h\n/usr/local/include/itcl2TclOO.h\n/usr/local/include/itclDecls.h\n/usr/local/include/itclInt.h\n/usr/local/include/itclIntDecls.h\n/usr/local/include/itclMigrate2TclCore.h\n/usr/local/include/itclTclIntStubsFcn.h\n/usr/local/include/mysqlStubs.h\n/usr/local/include/odbcStubs.h\n/usr/local/include/pqStubs.h\n/usr/local/include/tcl.h\n/usr/local/include/tclDecls.h\n/usr/local/include/tclOO.h\n/usr/local/include/tclOODecls.h\n/usr/local/include/tclPlatDecls.h\n/usr/local/include/tclThread.h\n/usr/local/include/tclTomMath.h\n/usr/local/include/tclTomMathDecls.h\n/usr/local/include/tdbc.h\n/usr/local/include/tdbcDecls.h\n/usr/local/include/tdbcInt.h\n/usr/local/include/tk.h\n/usr/local/include/tkDecls.h\n/usr/local/include/tkPlatDecls.h\nWarning: Unbrewed .pc files were found in /usr/local/lib/pkgconfig.\nIf you didn't put them there on purpose they could cause problems when\nbuilding Homebrew formulae, and may need to be deleted.\nUnexpected .pc files:\n/usr/local/lib/pkgconfig/tcl.pc\n/usr/local/lib/pkgconfig/tk.pc\nWarning: Unbrewed static libraries were found in /usr/local/lib.\nIf you didn't put them there on purpose they could cause problems when\nbuilding Homebrew formulae, and may need to be deleted.\nUnexpected static libraries:\n/usr/local/lib/libtclstub8.6.a\n/usr/local/lib/libtkstub8.6.a\nWarning: You have unlinked kegs in your Cellar\nLeaving kegs unlinked can lead to build-trouble and cause brews that depend on\nthose kegs to fail to run properly once built. Run `brew link` on these:\ngdbm\nWarning: /usr/bin occurs before /usr/local/bin\nThis means that system-provided programs will be used instead of those\nprovided by Homebrew. The following tools exist at both paths:\n2to3\n2to3-2.7\neasy_install\neasy_install-2.7\nidle\nidle2.7\ninfo\ninfokey\ninstall-info\nmakeinfo\npydoc\npydoc2.7\npython\npython-config\npython2.7\npython2.7-config\npythonw\npythonw2.7\nsmtpd.py\nsmtpd2.7.py\ntexi2dvi\ntexi2pdf\ntexindex\nConsider setting your PATH so that /usr/local/bin\noccurs before /usr/bin. Here is a one-liner:\necho export PATH='/usr/local/bin:$PATH' >> ~/.bash_profile\nWarning: Your Homebrew is outdated.\nYou haven't updated for at least 24 hours. This is a long time in brewland!\nTo update Homebrew, run `brew update`.",
    "My ex": "What does it mean to live a good life? How do you know if your life has been good, and how can you maximize your chances of having lived a good life?\nWhy has religion enjoyed such unparalleled success over the years? How can we build secular structures that are just as successful and beneficial as their religious counterparts?\nHow is it that after thousands of years of struggling through the same fundamental human condition, we have yet to make material progress in some very basic things? In short, people still make basic mistakes that others in the past have made before and already know how to avoid. E.g. people still fall rashly in love and relationships still fail for the same reasons, weâ\u0080\u0099ve yet to determine the ideal way to raise a child, learning interpersonal skills is still largely trial and error, etc., etc. Not the best examples, but hopefully gives an idea. Are there some things simply impossible vicariously that can only be accomplished through first-hand experience, or can we continuously work to make these things better for future generations, so we can stop repeating the same mistakes over and over?\nhttps://en.wikipedia.org/wiki/Taxation_as_theft#How_many_men.3F\nhttp://www.nickbostrom.com/extraterrestrial.pdf\nWould it be good or bad if we, as humans, create an artificial super intelligence that causes the extinction of humanity, but continues on to progress and thrive at a rate and in directions humans could never achieve as the evolutionary successors to our species?\nIt seems the world is quick to forget the transgressions of the past. For instance, much of Central and South America is devoutly Christian - however, this is only because Christian missionaries and conquistadors violently conquered, murdered, raped, and brainwashed the indigenous populations and coerced them into adhering to Christianity. Within a few generations, the resultant culture had adopted the beliefs as their own, and now strongly identify with them. Iâ\u0080\u0099m not sure how I feel about this. In a sense, it feels like the conquistadors, though seemingly clearly â\u0080\u0098wrongâ\u0080\u0099 and â\u0080\u0098immoralâ\u0080\u0099 in their methods, won and succeeded in an immense way in achieving their aims. Same with much of imperialism. Should these cultures renounce these forcibly indoctrinated values, is it fine for them to have adopted these values as their own now after the fact, or something else?\nIs it more ethically wrong to kill a cow than a clam? If a lobster is incapable of feeling pain or suffering, is it still wrong for us to slaughter them? Is it *more* wrong to kill something that will suffer through the process than something that wonâ\u0080\u0099t?\nhttps://en.wikipedia.org/wiki/Private_language_argument#The_Beetle_in_a_box\nCan things be good or bad? https://en.wikipedia.org/wiki/Big_Book_(thought_experiment)\nDoes akrasia exist? https://en.wikipedia.org/wiki/Akrasia In the dialogue Protagoras, Socrates attests that akrasia does not exist, claiming â\u0080\u009cNo one goes willingly toward the badâ\u0080\u009d (358d). If a person examines a situation and decides to act in the way he determines to be best, he will actively pursue this action, as the best course is also the good course, i.e. man's natural goal. An all-things-considered assessment of the situation will bring full knowledge of a decision's outcome and worth linked to well-developed principles of the good. A person, according to Socrates, never chooses to act poorly or against his better judgment; actions that go against what is best are only a product of being ignorant of facts or knowledge of what is best or good.\nhttps://en.wikipedia.org/wiki/Utility_monster\nhttps://en.wikipedia.org/wiki/Trolley_problem\nhttps://en.wikipedia.org/wiki/Ticking_time_bomb_scenario\nIs one life ever worth more than another? Assume that the worldâ\u0080\u0099s greatest surgeon, who in a day can save 10 lives that no one else can, is about to be hit by a trolley. You can divert the trolley to kill 2 wholly average and perfectly replaceable middle-class citizens who work regular jobs - letâ\u0080\u0099s say theyâ\u0080\u0099re mediocre software engineers. Would it be right to kill those 2? What if it were only one average citizen? How about 5, 10, 100?\nIs there a difference between killing and letting die? If the end result is exactly the same - if you see a train hurtling down at that middle class citizen vs the surgeon and donâ\u0080\u0099t switch a lever to kill the surgeon instead, is that wrong? What if it is switched, and the train is hurtling down to kill the surgeon unless you switch a lever to kill the middle class citizen instead? Should you switch the lever then? Is it wrong to switch the lever to have the exact same outcome as in the first scenario, or wrong to not switch the lever to have the opposite outcome?\nhttps://en.wikipedia.org/wiki/The_survival_lottery\nIs there a difference between having the experience of doing something, and â\u0080\u0098trulyâ\u0080\u0099 doing it? Would we rather live in a virtual reality in which we are the greatest person in the world and have accomplished every great desire we hold dear in our current lives, or would we rather live in a â\u0080\u0098realâ\u0080\u0099 world in which we fail to do all the things we hope to do? https://en.wikipedia.org/wiki/Experience_machine\nAre people fundamentally good? Bad? Should trust be earned, or should trust be given and assumed unless violated? Should we assume someone is good unless proven otherwise, or should we assume they are not unless they prove that they are?\nDoes the end ever justify the means? Are there some means that are just inviolably bad, no matter what good they might bring about? (similar to the ticking time bomb question)\nhttp://www.nickbostrom.com/fable/dragon.html"
}